artifacts/wsdl/tickets.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e. -->
<definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
             xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy"
             xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"
             xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://service.second.webservice.kth.se/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/"
             targetNamespace="http://service.second.webservice.kth.se/" name="IssueTicketService">
    <types>
        <xsd:schema>
            <xsd:import namespace="http://service.second.webservice.kth.se/"
                        schemaLocation="http://localhost:9091/tickets?xsd=1"></xsd:import>
        </xsd:schema>
    </types>
    <message name="issueTicket">
        <part name="parameters" element="tns:issueTicket"></part>
    </message>
    <message name="issueTicketResponse">
        <part name="parameters" element="tns:issueTicketResponse"></part>
    </message>
    <portType name="IssueTicket">
        <operation name="issueTicket">
            <input wsam:Action="http://service.second.webservice.kth.se/IssueTicket/issueTicketRequest"
                   message="tns:issueTicket"></input>
            <output wsam:Action="http://service.second.webservice.kth.se/IssueTicket/issueTicketResponse"
                    message="tns:issueTicketResponse"></output>
        </operation>
    </portType>
    <binding name="IssueTicketPortBinding" type="tns:IssueTicket">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"></soap:binding>
        <operation name="issueTicket">
            <soap:operation soapAction=""></soap:operation>
            <input>
                <soap:body use="literal"></soap:body>
            </input>
            <output>
                <soap:body use="literal"></soap:body>
            </output>
        </operation>
    </binding>
    <service name="IssueTicketService">
        <port name="IssueTicketPort" binding="tns:IssueTicketPortBinding">
            <soap:address location="http://localhost:9091/tickets"></soap:address>
        </port>
    </service>
</definitions>