artifacts/messages/task6/requestIssueTicket.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <S:Body>
        <ns2:issueTicket xmlns:ns2="http://service.second.webservice.kth.se/">
            <arg0>14</arg0>
        </ns2:issueTicket>
    </S:Body>
</S:Envelope>